tap "derailed/k9s"
tap "1password/tap"
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "pulumi/tap"

# GNU utilities (those that come with macOS are outdated)
brew "coreutils"
brew "findutils"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "gnutls"
brew "grep"
brew "make"
brew "moreutils"

# More recent versions of some macOS tools
brew "curl", link: true
brew "gcc"
brew "gmp"
brew "nano"
brew "openssh"
brew "screen"
brew "unzip", link: true
brew "vim"  #, args: ["with-override-system-vi"]

# Other useful binaries
brew "ack"
brew "autoconf"
brew "automake"
brew "ffmpeg"  #, args: ["with-libvpx"]
brew "imagemagick"  #, args: ["with-webp"]
brew "jemalloc"
brew "less"
brew "libsass", args: ["HEAD"]
brew "libyaml"
brew "mtr"
brew "openssl@1.1" if OS.mac?
brew "p7zip"
brew "pkg-config"
brew "readline"
brew "sidneys/homebrew/unrar" if OS.mac?
brew "ssh-copy-id", link: true
brew "tmux"
brew "tree"
brew "wget"  #, args: ["with-iri"]

# Git
brew "git"
brew "git-lfs"
brew "gh"

# Mostly ordinary binaries
brew "asciinema"
brew "aws-shell"
brew "awscli"
brew "carthage"
brew "cocoapods"
brew "composer"
brew "derailed/k9s/k9s"
brew "doctl"
brew "fx"
brew "go"
brew "guetzli"
brew "htop"
brew "httpie"
brew "httrack"
brew "hugo", args: ["HEAD"]
brew "ipinfo-cli"
brew "iproute2mac"
brew "jless"
brew "jq"
brew "k3sup"
brew "kubernetes-cli"
brew "mariadb"
brew "mas" if OS.mac?
brew "mhash"
brew "mkcert"
brew "ncurses"
brew "neofetch"
brew "netcat"
brew "nvm"
brew "openjdk"
brew "openvpn"
brew "optipng"
brew "pandoc"
brew "pulumi/tap/pulumi"
brew "pngcrush"
brew "protobuf"
brew "pyenv" unless OS.linux?
brew "qemu"
brew "rbenv" unless OS.linux?
brew "rclone"
brew "rlwrap"
brew "ruby-build" unless OS.linux?
brew "rust"
brew "s3cmd"
brew "shellcheck"
brew "shfmt"
brew "sqlite"
brew "subversion"
brew "svn"
brew "whois", link: true

###############################
#  macOS Apps via Cask        #
###############################

cask_args appdir: "/Applications"

# System Utilities
cask "alt-tab"
cask "hiddenbar"
cask "istat-menus"

# Passwords, VPNs, other Security
cask "1password"
cask "1password-cli"

# Development/Work
cask "dbeaver-community"
cask "figma"
cask "postman"
cask "visual-studio-code"

# Media
cask "spotify"

# Virtual Machines (& Docker)
cask "docker"

# Communication/Social
cask "discord"
cask "slack"
cask "zoom"
cask "telegram"

vscode "766b.go-outliner"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alexisvt.flutter-snippets"
vscode "astro-build.astro-vscode"
vscode "beaugunderson.solidity-extended"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "ChakrounAnas.turbo-console-log"
vscode "csstools.postcss"
vscode "cstrap.flask-snippets"
vscode "damildrizzy.fastapi-snippets"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "IBM.output-colorizer"
vscode "iden3.circom"
vscode "Ionic.ionic"
vscode "Ionide.Ionide-fsharp"
vscode "James-Yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "jock.svg"
vscode "jsayol.firebase-explorer"
vscode "JuanBlanco.solidity"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "pflannery.vscode-versionlens"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "quicktype.quicktype"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "RemixProject.ethereum-remix"
vscode "ritwickdey.LiveServer"
vscode "rpinski.shebang-snippets"
vscode "ryanluker.vscode-coverage-gutters"
vscode "shakram02.bash-beautify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sissel.shopify-liquid"
vscode "steoates.autoimport"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tintinweb.solidity-visual-auditor"
vscode "tintinweb.vscode-ethover"
vscode "tintinweb.vscode-inline-bookmarks"
vscode "tintinweb.vscode-solidity-flattener"
vscode "tintinweb.vscode-solidity-language"
vscode "toba.vsfire"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "wix.glean"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
